//////////////////////////////////////////////////////////////////////////////////////////////////////////
// Методы общей функциональности конфигурации
//  
//////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Параметры:
//  ИмяПараметра - Строка
//  УстановленныеПараметры - Массив из Строка
//
Процедура УстановкаПараметровСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ИмяПараметра = "ВыполняетсяОтладкаВКопии" Тогда
		ПараметрыСеанса.ВыполняетсяОтладкаВКопии = Ложь;
		УстановленныеПараметры.Добавить("ВыполняетсяОтладкаВКопии");
	КонецЕсли;
	
КонецПроцедуры

// Приостанавливает работу программы на выбранный период времени
// 
// Параметры:
//  Секунд - Число - количество секунд, которое необходимо ждать потоку выполнения
Процедура Пауза(Секунд) Экспорт
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ОбщегоНазначенияУК.Пауза", Параметры);
	КонецЕсли;
	
	ФоновоеЗадание.ОжидатьЗавершенияВыполнения(Секунд);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти