                  
Процедура УстановитьБлокировку(Номенклатура = Неопределено, Склад = Неопределено, ДлительностьБлокировки = 3) Экспорт
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварныеЗапасы");
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			ЭлементБлокировки.УстановитьЗначение("Номенклатура", Номенклатура);
		КонецЕсли;
		Если ЗначениеЗаполнено(Склад) Тогда
			ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
		КонецЕсли;
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		ОбщегоНазначенияУК.Пауза(ДлительностьБлокировки);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			"Случай1",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение "Запрашиваемый ресурс заблокирован.";
	КонецПопытки;
	
КонецПроцедуры
